CSI API ETABS v1
cAreaObj.SetModifiers Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetModifiers(
	string Name,
	ref double[] Value,
	eItemType ItemType = eItemType.Objects
)
Function SetModifiers (
	Name As String,
	ByRef Value As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim Value As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetModifiers(Name,
	Value, ItemType)
int SetModifiers(
	String^ Name,
	array<double>^% Value,
	eItemType ItemType = eItemType::Objects
)
abstract SetModifiers :
        Name : string *
        Value : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
Value
Type: System.Double[]
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace